src/Documents/ЗаявкаНаРасходованиеСредств/ЗаявкаНаРасходованиеСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРасходованиеСредств</name>
  <basedOn>Document.БюджетнаяОперация</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ПоступлениеДопРасходов</basedOn>
  <basedOn>Document.ВозвратТоваровОтПокупателя</basedOn>
  <basedOn>Document.ОтчетКомитентуОПродажах</basedOn>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <basedOn>Document.ДоговорЗаймаСРаботником</basedOn>
  <basedOn>Document.СчетНаОплатуПоставщика</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслугВНТТ</basedOn>
  <basedOn>Document.ЗарплатаКВыплатеОрганизаций</basedOn>
  <registerRecords>AccumulationRegister.ЗаявкиНаРасходованиеСредств</registerRecords>
  <registerRecords>AccumulationRegister.РазмещениеЗаявокНаРасходованиеСредств</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.КонтролируемыеЗначенияБюджетов</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВРезерве</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаявкиНаРасходование</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <comment>Подотчетник, касса ККМ</comment>
    <type>
      <types>CatalogRef.КассыККМ</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОтчетКомитентуОПродажах</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.ПрочиеЗатраты</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ДоговорЗаймаСРаботником</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ВидыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКасса</name>
    <comment>Р/с, касса </comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетовПодотчетника</name>
    <comment>Валюта, в которой подотчетник должен отчитаться за истраченные деньги</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ДоговорЗаймаСРаботником</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогашенияАванса</name>
    <comment>(Упр) срок погашения аванса подотчетником</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоРезервированиеПоЗаявке</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоРазмещениеПоЗаявке</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВПлатежныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиДенежныхСредств</name>
    <type>
      <types>EnumRef.ВидВыдачиДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатнаяВедомость</name>
    <type>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DocumentRef.СчетНаОплатуПоставщика</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>КурсВзаиморасчетов</name>
      <comment>Курс валюты взаиморасчетов по договору или валюты взаиморасчетов с подотчетником</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРасчетовСКонтрагентом</name>
      <type>
        <types>DocumentRef.ОтчетКомитентуОПродажах</types>
        <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
        <types>DocumentRef.ПлатежноеТребованиеПоручениеПолученное</types>
        <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
        <types>DocumentRef.ПлатежноеТребованиеПоручениеВыставленное</types>
        <types>DocumentRef.АккредитивПолученный</types>
        <types>DocumentRef.РеализацияУслугПоПереработке</types>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПлатежноеТребованиеПолученное</types>
        <types>DocumentRef.ПоступлениеДопРасходов</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.АккредитивПереданный</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.КорректировкаДолгаПоВозвратнойТаре</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
        <types>DocumentRef.ПлатежноеТребованиеВыставленное</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмещениеЗаявки</name>
    <attributes>
      <name>МестоРазмещения</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
        <types>CatalogRef.Кассы</types>
        <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидыДенежныхСредств/ВидыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДенежныхСредств</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыОперацийЗаявкиНаРасходование/ВидыОперацийЗаявкиНаРасходование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаявкиНаРасходование</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствКассеККМ</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитамИЗаймамСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитамИЗаймамСРаботниками</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалога</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПеречислениеЗП</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчетыСКонтрагентами</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВедениеВзаиморасчетовПоДоговорам/ВедениеВзаиморасчетовПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВедениеВзаиморасчетовПоДоговорам</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоДоговоруВЦелом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоЗаказам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСчетам</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаявкаНаРасходованиеСредств/Forms/РасчетыСКонтрагентами/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОСНОВНЫЕ РЕКВИЗИТЫ

// Очищает реквизиты, относящиеся к платежам
//
&НаКлиенте
Процедура ПриОчисткеВалютыДокумента()
	
	Объект.СуммаДокумента = 0;
	Объект.КурсДокумента = 0;
	Объект.КратностьДокумента = 0;
	
	Для Каждого Платеж Из Объект.РасшифровкаПлатежа Цикл
		Платеж.СуммаПлатежа = 0;
	КонецЦикла;
	
	Объект.БанковскийСчетКасса = Неопределено;
	Объект.ВключатьВПлатежныйКалендарь = Ложь;
	
КонецПроцедуры

// Процедура устанавливает, что можно выбрать кассу или банковский счет
// В зависимости от формы оплаты
//
&НаКлиенте
Процедура ОграничитьВыборСчетаКассы()

	Если Объект.ФормаОплаты = ВидыДенежныхСредствБезналичные Тогда
		Элементы.БанковскийСчетКасса.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета");
	ИначеЕсли Объект.ФормаОплаты = ВидыДенежныхСредствНаличные Тогда
		Элементы.БанковскийСчетКасса.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Кассы");
	Иначе
		Элементы.БанковскийСчетКасса.ОграничениеТипа = Новый ОписаниеТипов;
	КонецЕсли;
	
КонецПроцедуры //

// Определяет доступность валюты документа
// Валюта недоступна, если выбрана касса или банковский счет
//
&НаКлиенте
Процедура УстановитьДоступностьВалютыДокумента()

	Если Объект.БанковскийСчетКасса = Неопределено ИЛИ Объект.БанковскийСчетКасса.Пустая() Тогда
		Элементы.ВалютаДокумента.Доступность = Истина;
	Иначе
		Элементы.ВалютаДокумента.Доступность = Ложь;
	КонецЕсли; 
	
КонецПроцедуры //

// Процедура изменяет валюту документа исходя из выбранной кассы или банковского счета
//
&НаСервере
Процедура ПолучитьВалютуБанковскогоСчетаИлиКассы()

	Объект.ВалютаДокумента = Объект.БанковскийСчетКасса.ВалютаДенежныхСредств;
	
	ПриИзмененииВалютыДокумента();
	
КонецПроцедуры //

// В процедуре пересчитывается сумма платежа и курс валюты документа
//
&НаСервере
Процедура ПриИзмененииВалютыДокумента()

	Если Объект.ВалютаДокумента = СтараяВалютаДокумента Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуПлатежаТаблица(Истина);
	
	СтараяВалютаДокумента = Объект.ВалютаДокумента;
	
КонецПроцедуры //
 
// Обработчик события "ПриИзменении" поля "Дата"
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаРасхода) И НЕ Объект.ВалютаДокумента.Пустая() Тогда
		
		РассчитатьСуммуПлатежаТаблица(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ДатаРасхода"
//
&НаКлиенте
Процедура ДатаРасходаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаРасхода) И НЕ Объект.ВалютаДокумента.Пустая() Тогда
		
		РассчитатьСуммуПлатежаТаблица(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ВалютаДокумента"
//
&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	Если Объект.ВалютаДокумента = СтараяВалютаДокумента Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВалютаДокумента.Пустая() Тогда
		ПриОчисткеВалютыДокумента();
	Иначе
		ПриИзмененииВалютыДокумента();
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ФормаОплаты"
//
&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	
	Объект.БанковскийСчетКасса = Неопределено;
	
	ОграничитьВыборСчетаКассы();
	
	УстановитьДоступностьВалютыДокумента();	
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "Контрагент"
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.РасшифровкаПлатежа.Очистить();
	СтрокаПлатежа = Объект.РасшифровкаПлатежа.Добавить();
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "БанковскийСчетКасса"
//
&НаКлиенте
Процедура БанковскийСчетКассаПриИзменении(Элемент)
	
	Если НЕ Объект.БанковскийСчетКасса.Пустая() Тогда
		ПолучитьВалютуБанковскогоСчетаИлиКассы();
	КонецЕсли;	
	
	Объект.РазмещениеЗаявки.Очистить();
	
	УстановитьДоступностьВалютыДокумента();	
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "Организация"
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если НЕ ПустаяСтрока(Объект.Номер) Тогда
		ПрефиксацияОбъектовСобытия.ОчиститьНомерОбъекта(Объект.Номер, Объект.Организация);
	КонецЕсли; 
	
	ОграничитьВыборДоговора();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// РАСЧЕТЫ С КОНТРАГЕНТАМИ

// Процедура ограничивает выбор договора по организации, если она указана
//
&НаКлиенте
Процедура ОграничитьВыборДоговора()

	ПараметрыВыбораДоговора = Элементы.РасшифровкаПлатежаДоговорКонтрагента.ПараметрыВыбора;
	
	УстановитьНовыеПараметры = Ложь;
	
	НовыйМассивПараметров = Новый Массив;
	Для каждого СвязьПараметровВыбора Из ПараметрыВыбораДоговора Цикл
		НовыйМассивПараметров.Добавить(СвязьПараметровВыбора);
	КонецЦикла;
	
	// Удалим выбор по организации
	ИндексСвязи = 0;
	Для каждого ПараметрВыбора Из НовыйМассивПараметров Цикл
		Если ПараметрВыбора.Имя = "Отбор.Организация" Тогда
			НовыйМассивПараметров.Удалить(ИндексСвязи);
			УстановитьНовыеПараметры = Истина;
			Прервать;
		КонецЕсли;
		ИндексСвязи = ИндексСвязи + 1;
	КонецЦикла;
	
	Если НЕ Объект.Организация.Пустая() Тогда
		// Добавим выбор по организации
		ЕстьПараметрПоОрганизации = Ложь;
		Для каждого ПараметрВыбора Из НовыйМассивПараметров Цикл
			Если ПараметрВыбора.Имя = "Отбор.Организация" Тогда
				ЕстьПараметрПоОрганизации = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьПараметрПоОрганизации Тогда
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.Организация", Объект.Организация);
			НовыйМассивПараметров.Добавить(ПараметрВыбора);
			УстановитьНовыеПараметры = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	Если УстановитьНовыеПараметры Тогда
		Элементы.РасшифровкаПлатежаДоговорКонтрагента.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассивПараметров);
	КонецЕсли; 
	
КонецПроцедуры //
 
// Функция возвращает данные необходимые для выполнения действий связанных с изменением договора
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеПриИзмененииДоговора(ПараметрыДокумента)

	СтруктураДанных = Новый Структура;
	
	СвойстваДоговора = ОбщегоНазначенияПовтИсп.ПолучитьЗначенияРеквизитовОбъекта(ПараметрыДокумента.ДоговорКонтрагента, Новый Структура("ВалютаВзаиморасчетов,ОсновнаяСтатьяДвиженияДенежныхСредств"), "Справочник.ДоговорыКонтрагентов");
	
	ТекущаяВалютаВзаиморасчетов = СвойстваДоговора.ВалютаВзаиморасчетов;
	
	СтруктураДанных.Вставить("ВалютаВзаиморасчетов", ТекущаяВалютаВзаиморасчетов);
	
	СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(ТекущаяВалютаВзаиморасчетов, ПараметрыДокумента.Дата);
	
	СтруктураДанных.Вставить("СтруктураКурсаВзаиморасчетов", СтруктураКурсаВзаиморасчетов);
	
	Если ЗначениеЗаполнено(СвойстваДоговора.ОсновнаяСтатьяДвиженияДенежныхСредств) Тогда
		СтруктураДанных.Вставить("СтатьяДвиженияДенежныхСредств", СвойстваДоговора.ОсновнаяСтатьяДвиженияДенежныхСредств);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции //

// Процедура пересчитывает сумму платежа в ТЧ "РасшифровкаПлатежа"
// исходя из суммы взаиморасчетов
//
&НаСервере
Процедура РассчитатьСуммуПлатежаТаблица(УстановитьКурсДокумента = Ложь)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если УстановитьКурсДокумента Тогда
		ДатаКурса = ?(ДокументОбъект.ДатаРасхода='00010101', ДокументОбъект.Дата, ДокументОбъект.ДатаРасхода);
		СтруктураКурсаВалютаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДатаКурса);
		ДокументОбъект.КурсДокумента        = СтруктураКурсаВалютаДокумента.Курс;
		ДокументОбъект.КратностьДокумента   = СтруктураКурсаВалютаДокумента.Кратность;
	КонецЕсли; 
	
	Для Каждого СтрокаПлатеж Из ДокументОбъект.РасшифровкаПлатежа Цикл
		
		ВалютаВзаиморасчетов = СтрокаПлатеж.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		
		Если ВалютаВзаиморасчетов = ДокументОбъект.ВалютаДокумента Тогда
			
			СтрокаПлатеж.СуммаПлатежа = СтрокаПлатеж.СуммаВзаиморасчетов;
	
		ИначеЕсли (ДокументОбъект.КурсДокумента <> 0) И (СтрокаПлатеж.КратностьВзаиморасчетов <> 0) И (СтрокаПлатеж.КурсВзаиморасчетов <> 0) Тогда
			СтрокаПлатеж.СуммаПлатежа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
												СтрокаПлатеж.СуммаВзаиморасчетов, 
												ВалютаВзаиморасчетов,
												ДокументОбъект.ВалютаДокумента,
												СтрокаПлатеж.КурсВзаиморасчетов,
												ДокументОбъект.КурсДокумента,
												СтрокаПлатеж.КратностьВзаиморасчетов,
												ДокументОбъект.КратностьДокумента);
		Иначе
			СтрокаПлатеж.СуммаПлатежа = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

// Процедура рассчитывает курс взаиморасчетов в строке ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РассчитатьКурсВзаиморасчетов(СтрокаПлатеж)
	
	Если (СтрокаПлатеж.СуммаВзаиморасчетов <> 0) И (Объект.КратностьДокумента <> 0) Тогда
		СтрокаПлатеж.КурсВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа
							* Объект.КурсДокумента 
							* СтрокаПлатеж.КратностьВзаиморасчетов
							/ СтрокаПлатеж.СуммаВзаиморасчетов
							/ Объект.КратностьДокумента;
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчитывает сумму взаиморасчетов в ТЧ "РасшифровкаПлатежа" 
// исходя из суммы платежа
//
&НаКлиенте
Процедура РассчитатьСуммуВзаиморасчетов(СтрокаПлатеж, ВалютаВзаиморасчетов)
	
	Если ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
		СтрокаПлатеж.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа;
			
	ИначеЕсли СтрокаПлатеж.КурсВзаиморасчетов <> 0 
		И Объект.КратностьДокумента <> 0
		И СтрокаПлатеж.КурсВзаиморасчетов <> 0 Тогда
		
		СтрокаПлатеж.СуммаВзаиморасчетов = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
													СтрокаПлатеж.СуммаПлатежа,
													Объект.ВалютаДокумента,
			                                        ВалютаВзаиморасчетов,
			                                        Объект.КурсДокумента, 
													СтрокаПлатеж.КурсВзаиморасчетов,
													Объект.КратностьДокумента, 
													СтрокаПлатеж.КратностьВзаиморасчетов);	
	Иначе
		СтрокаПлатеж.СуммаВзаиморасчетов = 0;
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");

КонецПроцедуры

// Процедура пересчитывает сумму платежа в строке ТЧ "РасшифровкаПлатежа" 
// исходя из суммы взаиморасчетов
//
&НаКлиенте
Процедура РассчитатьСуммуПлатежа(СтрокаПлатеж, ВалютаВзаиморасчетов)
	
	Если ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
		СтрокаПлатеж.СуммаПлатежа = СтрокаПлатеж.СуммаВзаиморасчетов;
	
	ИначеЕсли (Объект.КурсДокумента <> 0) 
		И (СтрокаПлатеж.КратностьВзаиморасчетов <> 0)
		И (СтрокаПлатеж.КурсВзаиморасчетов <> 0) Тогда
		
		СтрокаПлатеж.СуммаПлатежа = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(
										СтрокаПлатеж.СуммаВзаиморасчетов, 
										ВалютаВзаиморасчетов,
										Объект.ВалютаДокумента,
			                            СтрокаПлатеж.КурсВзаиморасчетов,
										Объект.КурсДокумента,
										СтрокаПлатеж.КратностьВзаиморасчетов,
										Объект.КратностьДокумента);
	Иначе
		СтрокаПлатеж.СуммаПлатежа = 0;
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");

КонецПроцедуры

// Процедура устанавливает тип сделки который можно выбрать
// Тип сделки зависит от вида операции и договора
//
&НаКлиенте
Процедура УстановитьПараметрыВыбораСделки()

	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если СтрокаПлатеж.ДоговорКонтрагента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидОперации <> ВидОперацииОплатаПоставщику
		И Объект.ВидОперации <> ВидОперацииВозвратДенежныхСредствПокупателю Тогда
		Возврат;
	КонецЕсли;
		
	СвойстваДоговора = ОбщегоНазначенияПовтИсп.ПолучитьЗначенияРеквизитовОбъекта(СтрокаПлатеж.ДоговорКонтрагента, Новый Структура("ВедениеВзаиморасчетов"), "Справочник.ДоговорыКонтрагентов");
	
	Если Объект.ВидОперации = ВидОперацииОплатаПоставщику  Тогда
		СтрокаТипаЗаказа = "ЗаказПоставщику";
		ТипДокументаСчет = "СчетНаОплатуПоставщика";
	ИначеЕсли Объект.ВидОперации = ВидОперацииВозвратДенежныхСредствПокупателю Тогда
		СтрокаТипаЗаказа = "ЗаказПокупателя";
		ТипДокументаСчет = "СчетНаОплатуПокупателю";
	КонецЕсли;
	
	Если СвойстваДоговора.ВедениеВзаиморасчетов = ВедениеВзаиморасчетовПоСчетам Тогда
		ТипДокументаСделки = ТипДокументаСчет;
	Иначе
		ТипДокументаСделки = СтрокаТипаЗаказа;
	КонецЕсли; 
	
	Элементы.РасшифровкаПлатежаСделка.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка." + ТипДокументаСделки);
	
КонецПроцедуры //

// Процедура изменяет курс взаиморасчетов и заполняет другие поля строки, связанные с договором
//
&НаКлиенте
Процедура ПриИзмененииДоговора(СтрокаПлатеж)
	
	ДанныеОбменаССервером = Новый Структура;
	ДанныеОбменаССервером.Вставить("Дата", Объект.Дата);
	ДанныеОбменаССервером.Вставить("ДоговорКонтрагента", СтрокаПлатеж.ДоговорКонтрагента);
	ЗначенияДляЗаполнения = ПолучитьДанныеПриИзмененииДоговора(ДанныеОбменаССервером);
	
	СтрокаПлатеж.Сделка = Неопределено; // Для сделки нет значения по умолчанию в договоре
	СтрокаПлатеж.ДокументРасчетовСКонтрагентом = Неопределено; 

	// Надо поменять валюту и курс взаиморасчетов
	СтрокаПлатеж.КурсВзаиморасчетов      = ЗначенияДляЗаполнения.СтруктураКурсаВзаиморасчетов.Курс;
	СтрокаПлатеж.КратностьВзаиморасчетов = ЗначенияДляЗаполнения.СтруктураКурсаВзаиморасчетов.Кратность;
	
	РассчитатьСуммуВзаиморасчетов(СтрокаПлатеж, ЗначенияДляЗаполнения.ВалютаВзаиморасчетов);

	Если ЗначенияДляЗаполнения.Свойство("СтатьяДвиженияДенежныхСредств") Тогда
		СтрокаПлатеж.СтатьяДвиженияДенежныхСредств = ЗначенияДляЗаполнения.СтатьяДвиженияДенежныхСредств;
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "ДоговорКонтрагента" в ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаДоговорКонтрагентаПриИзменении(Элемент)
	
	ПриИзмененииДоговора(Элементы.РасшифровкаПлатежа.ТекущиеДанные);
	УстановитьПараметрыВыбораСделки();
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "СуммаПлатеж" в ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаПлатежаПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	РассчитатьКурсВзаиморасчетов(СтрокаПлатеж);
	Объект.СуммаДокумента = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
КонецПроцедуры

// Обработчик события "ПриИзменении" поля "СуммаВзаиморасчетов" в ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаСуммаВзаиморасчетовПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	СвойстваДоговора = ОбщегоНазначенияПовтИсп.ПолучитьЗначенияРеквизитовОбъекта(СтрокаПлатеж.ДоговорКонтрагента, Новый Структура("ВалютаВзаиморасчетов"), "Справочник.ДоговорыКонтрагентов");
	
	ТекущаяВалютаВзаиморасчетов = СвойстваДоговора.ВалютаВзаиморасчетов;
	
	РассчитатьСуммуПлатежа(СтрокаПлатеж, ТекущаяВалютаВзаиморасчетов);
	
КонецПроцедуры

// Обработчик события "ПередУдалением" ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаПередУдалением(Элемент, Отказ)
	
	Если Объект.РасшифровкаПлатежа.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ПриНачалеРедактирования" ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УстановитьПараметрыВыбораСделки();
	
КонецПроцедуры

// Обработчик события "НачалоВыбора" поля "Сделка" в ТЧ "РасшифровкаПлатежа"
//
&НаКлиенте
Процедура РасшифровкаПлатежаСделкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если СтрокаПлатеж.ДоговорКонтрагента.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ФОРМА

// В процедуре инициализируются значения констант формы
// Константы используются при выполнении модуля формы
//
&НаСервере
Процедура УстановитьЗначенияКонстантФормы()
	
	ВидыДенежныхСредствБезналичные = Перечисления.ВидыДенежныхСредств.Безналичные;
	ВидыДенежныхСредствНаличные    = Перечисления.ВидыДенежныхСредств.Наличные;
	
	ВидОперацииОплатаПоставщику = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
	ВидОперацииВозвратДенежныхСредствПокупателю = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю;
	
	ВедениеВзаиморасчетовПоСчетам = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам;
	
КонецПроцедуры //

// Процедура устанавливает параметры выбора договора в ТЧ "РасшифровкаПлатежа"
// Выбор договора зависит от вида операции
//
&НаСервере
Процедура УстановитьПараметрыВыбораДоговора()
	
	СписокВидовДоговоров = УправлениеДенежнымиСредствами.ОпределитьВидДоговораСКонтрагентом(Объект.ВидОперации);
	
	МассивПараметровВыбора = Новый Массив;
	
	МассивВидовДоговоров = СписокВидовДоговоров.ВыгрузитьЗначения();
	
	НовыйПараметрВыбора = Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоров));
	МассивПараметровВыбора.Добавить(НовыйПараметрВыбора);
	
	Элементы.РасшифровкаПлатежаДоговорКонтрагента.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры //

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияКонстантФормы();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		// Это существующий документ. 
		// Проверим, что его можно менять.
		НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(РеквизитФормыВЗначение("Объект"), ЭтаФорма);
		
		//Если используется функционал согласования заявок - проверим можно ли редактировать заявку
		Если НЕ ТолькоПросмотр Тогда
			ТолькоПросмотр = НЕ УправлениеДенежнымиСредствами.РазрешеноИзменениеЗаявки(Объект.Ссылка);
		КонецЕсли;
		
	Иначе
		
		Если Параметры.Свойство("КопируемыйОбъект") Тогда
			// Форма создается программно, при этом выполняется копирование
			ДокументОбъект = РеквизитФормыВЗначение("Объект");
			ЗаполнитьЗначенияСвойств(ДокументОбъект, Параметры.КопируемыйОбъект,, "Номер,Дата,ПометкаУдаления,Проведен,Ответственный,Состояние,АвтоРезервированиеПоЗаявке,АвтоРазмещениеПоЗаявке");
			ДокументОбъект.РасшифровкаПлатежа.Загрузить(Параметры.КопируемыйОбъект.РасшифровкаПлатежа.Выгрузить());
			
			ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		КонецЕсли;
		
		Если Параметры.ВидОперации.Пустая() Тогда
			Объект.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику;
		Иначе
			Объект.ВидОперации = Параметры.ВидОперации;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами Тогда
		Элементы.РасшифровкаПлатежаСделка.Видимость = Ложь;
	КонецЕсли; 
	
	СтараяВалютаДокумента = Объект.ВалютаДокумента;	
	
	УстановитьПараметрыВыбораДоговора();
	
	// Установим заголовок основной страницы
	ВидОперацииСтрока = Строка(Объект.ВидОперации);
	Элементы.РасчетыСКонтрагентами.Заголовок = ВРег(Лев(ВидОперацииСтрока,1)) + Сред(ВидОперацииСтрока,2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СуммаРасшифровки = Объект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Если СуммаРасшифровки <> Объект.СуммаДокумента Тогда
		
		Если Вопрос("Не совпадают сумма документа и ее расшифровка. Пересчитать сумму документа?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да)=КодВозвратаДиалога.Да Тогда
			
			Объект.СуммаДокумента = СуммаРасшифровки;
			
		Иначе
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОграничитьВыборСчетаКассы();
	ОграничитьВыборДоговора();
	УстановитьДоступностьВалютыДокумента();
	
КонецПроцедуры
